2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_OnderhoudAfnemerindicaties/data/verstrekkingsbeperking-op-Sinterklaas-TC01-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670035</ABONNEMENT>
			<NAAM>*</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
  <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>*</brp:zendendePartij>
    <brp:zendendeSysteem>*</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>*</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Mutaties op specifieke personen voor afnemer is 034401</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van afnemerindicatie</brp:categorieDienst>
  </brp:parameters>
  <brp:meldingen>
    <brp:melding brp:objecttype="Melding" brp:referentieID="1">
      <brp:regelCode>BRLV0032</brp:regelCode>
      <brp:soortNaam>Waarschuwing</brp:soortNaam>
      <brp:melding>Waarschuwing: verstrekkingsbeperking aanwezig.</brp:melding>
    </brp:melding>
  </brp:meldingen>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>*</brp:code>
    <brp:naam>*</brp:naam>
    <brp:categorie>*</brp:categorie>
    <brp:partijCode>*</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="*">
        <brp:soortCode>*</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>*</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>677080426</brp:burgerservicenummer>
          <brp:administratienummer>1097207412</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>*</brp:indicatieNamenreeks>
          <brp:voornamen>*</brp:voornamen>
          <brp:voorvoegsel>*</brp:voorvoegsel>
          <brp:scheidingsteken>*</brp:scheidingsteken>
          <brp:geslachtsnaamstam>*</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datum>*</brp:datum>
          <brp:gemeenteCode>*</brp:gemeenteCode>
          <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
          <brp:omschrijvingLocatie>*</brp:omschrijvingLocatie>
          <brp:landGebiedCode>*</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:code>*</brp:code>
        </brp:geslachtsaanduiding>
        <brp:bijhouding brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:partijCode>*</brp:partijCode>
          <brp:bijhoudingsaardCode>*</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>*</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>*</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:datumEindeGeldigheid>*</brp:datumEindeGeldigheid>
          <brp:actieAanpassingGeldigheid>*</brp:actieAanpassingGeldigheid>
          <brp:partijCode>*</brp:partijCode>
          <brp:bijhoudingsaardCode>*</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>*</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>*</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>*</brp:actieVerval>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:partijCode>*</brp:partijCode>
          <brp:bijhoudingsaardCode>*</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>*</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>*</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Toevoeging" brp:objectSleutel="*" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
            <brp:soortCode>*</brp:soortCode>
            <brp:redenWijzigingCode>*</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>*</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>*</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>*</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>*</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>*</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>*</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>*</brp:afgekorteNaamOpenbareRuimte>
            <brp:gemeentedeel>*</brp:gemeentedeel>
            <brp:huisnummer>*</brp:huisnummer>
            <brp:postcode>*</brp:postcode>
            <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
            <brp:landGebiedCode>*</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Wijziging" brp:objectSleutel="*" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
            <brp:datumEindeGeldigheid>*</brp:datumEindeGeldigheid>
            <brp:actieAanpassingGeldigheid>*</brp:actieAanpassingGeldigheid>
            <brp:soortCode>*</brp:soortCode>
            <brp:redenWijzigingCode>*</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>*</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>*</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>*</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>*</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>*</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>*</brp:huisnummer>
            <brp:postcode>*</brp:postcode>
            <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
            <brp:landGebiedCode>*</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Verval" brp:objectSleutel="*" brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:actieVerval>*</brp:actieVerval>
            <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
            <brp:soortCode>*</brp:soortCode>
            <brp:redenWijzigingCode>*</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>*</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>*</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>*</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>*</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>*</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>*</brp:huisnummer>
            <brp:postcode>*</brp:postcode>
            <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
            <brp:landGebiedCode>*</brp:landGebiedCode>
          </brp:adres>
        </brp:adressen>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>